voiceguard/Vulnerability Test Results/artillery-load-test.yml
# VoiceGuard API — Artillery load test (alternative to k6-load-test.js)
#
# Mirrors the same baseline/stress/spike/endurance profiles and traffic mix
# used in k6-load-test.js (see performance-report.md for real, executed
# baseline results from the k6 version). Provided as an alternative tool per
# the audit spec's Phase 7 requirement.
#
# Prerequisite: seed load-test users first — see performance/seed_users.py.
#
# Usage:
#   artillery run artillery-load-test.yml --target http://localhost:8000 -e baseline
#   artillery run artillery-load-test.yml --target http://localhost:8000 -e stress200
#   artillery run artillery-load-test.yml --target http://localhost:8000 -e spike
#   artillery run artillery-load-test.yml --target http://localhost:8000 -e endurance
#
# NOTE (same caveat as k6-load-test.js): this app correctly rate-limits login
# per source IP (RATE_LIMIT_LOGIN_PER_HOUR_PER_IP=10) and — as of the F-14
# fix — that can no longer be bypassed via a spoofed X-Forwarded-For header.
# Running many virtual users from one machine against /auth/login will hit
# that limit; raise it for the duration of a load-test run instead:
#   RATE_LIMIT_LOGIN_PER_HOUR_PER_IP=200 docker compose up -d backend

config:
  target: "http://localhost:8000"
  processor: "./artillery-functions.js"
  variables:
    password: "LoadTest!2345"
  environments:
    baseline:
      phases:
        - duration: 10
          arrivalRate: 5
          rampTo: 100
          name: "Ramp up to 100 VUs"
        - duration: 40
          arrivalRate: 100
          name: "Hold at 100 VUs"
        - duration: 10
          arrivalRate: 100
          rampTo: 0
          name: "Ramp down"
    stress200:
      phases:
        - duration: 30
          arrivalRate: 10
          rampTo: 200
          name: "Ramp to 200 VUs"
        - duration: 120
          arrivalRate: 200
          name: "Hold at 200 VUs"
    stress500:
      phases:
        - duration: 45
          arrivalRate: 10
          rampTo: 500
          name: "Ramp to 500 VUs"
        - duration: 120
          arrivalRate: 500
          name: "Hold at 500 VUs"
    stress1000:
      phases:
        - duration: 60
          arrivalRate: 10
          rampTo: 1000
          name: "Ramp to 1000 VUs"
        - duration: 120
          arrivalRate: 1000
          name: "Hold at 1000 VUs"
    spike:
      phases:
        - duration: 30
          arrivalRate: 50
          name: "Baseline 50 VUs"
        - duration: 10
          arrivalRate: 50
          rampTo: 500
          name: "Sudden spike to 500 VUs"
        - duration: 60
          arrivalRate: 500
          name: "Hold at spike level"
        - duration: 120
          arrivalRate: 50
          name: "Recovery observation window"
    endurance:
      phases:
        - duration: 60
          arrivalRate: 10
          rampTo: 100
          name: "Ramp to 100 VUs"
        - duration: 1680
          arrivalRate: 100
          name: "Hold at 100 VUs for 28 minutes"
  http:
    timeout: 30
  ensure:
    p95: 1500
    maxErrorRate: 5

scenarios:
  - name: "Authenticated user journey (dashboard / profile / scan detail / upload)"
    flow:
      - function: "pickRandomLoadUser"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ $randomLoadUser }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.user.id"
              as: "userId"
          expect:
            - statusCode: 200
      - think: 1
      - post:
          url: "/api/v1/scans"
          formData:
            file: "@./sample.wav"
          expect:
            - statusCode: [201, 409, 429]
      - think: 1
      - get:
          url: "/api/v1/scans?page=1&page_size=20"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/v1/user/profile"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/v1/dashboard"
          expect:
            # Was [200, 500] pre-fix: GET /dashboard crashed on a fresh
            # database's first call (security-review.md F-16, fixed).
            - statusCode: 200
